title: Postgres errors Data Exception
id: 65354b83-a2ea-4ea6-8414-3ab38be0d409
status: test
description: Detects data exception of postgres
references:
    - https://www.postgresql.org/docs/current/errcodes-appendix.html
author: Lucas Santos Ribeiro
date: 2024/04/16
modified: 2024/04/16
logsource:
    category: application
detection:
    selection:
        message:
            - 'array_subscript_error'
            - 'character_not_in_repertoire'
            - 'datetime_field_overflow'
            - 'division_by_zero'
            - 'error_in_assignment'
            - 'escape_character_conflict'
            - 'indicator_overflow'
            - 'interval_field_overflow'
            - 'invalid_argument_for_logarithm'
            - 'invalid_argument_for_ntile_function'
            - 'invalid_argument_for_nth_value_function'
            - 'invalid_argument_for_power_function'
            - 'invalid_argument_for_width_bucket_function'
            - 'invalid_character_value_for_cast'
            - 'invalid_datetime_format'
        priority: alert
        program: DATABASE
    condition: selection
level: high
