title: Postgres errors Connection Exception
id: 65354b83-a2ea-4ea6-8414-3ab38be0d409
status: test
description: Detects connection exception of postgres
references:
    - https://www.postgresql.org/docs/current/errcodes-appendix.html
author: Lucas Santos Ribeiro
date: 2024/04/16
modified: 2024/04/16
logsource:
    category: database
detection:
    selection:
        message:
        - 'connection_exception'
        - 'connection_does_not_exist'
        - 'connection_failure'
        - 'sqlclient_unable_to_establish_sqlconnection'
        - 'protocol_violation'
        priority: alert
    condition: selection
level: medium
